{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Metadata describing a feature update related to smooth fade‑in audio behavior and its associated files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend source files for reference.",
  "frontend/index.css": "Tailwind base layer defining OKLCH CSS variables for light and dark themes and applying global background/foreground styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component managing passcode unlock, modals, scrolling, and rendering all site sections with background music and decorations.",
  "frontend/src/components/ambient/RomanticBackground.tsx": "Renders floating hearts, petals, and sparkles as fixed animated ambient background elements.",
  "frontend/src/components/gallery/FlipImageCard.tsx": "Flip‑card image component supporting local image replacement with IndexedDB persistence and displaying a message on the back.",
  "frontend/src/components/gate/PasscodeGate.tsx": "Numeric keypad passcode lock enforcing a 12‑digit code with error shake animation and clear/delete controls.",
  "frontend/src/components/media/BackgroundMusicPlayer.tsx": "Custom audio player with play/mute controls and smooth fade‑in on autoplay, user play, and manual loop restarts.",
  "frontend/src/components/modals/EntryModal.tsx": "A dialog modal prompting entry with themed styling and a button triggering onEnter.",
  "frontend/src/components/modals/LoveLetterModal.tsx": "Scrollable dialog presenting a long romantic letter with decorative emojis.",
  "frontend/src/components/modals/RomanticMessageModal.tsx": "A birthday‑themed modal showing a short message with animated floating emojis.",
  "frontend/src/components/ornaments/BlinkingEmojiSequence.tsx": "Animated fixed header showing a sequence of blinking emojis that cycle every second.",
  "frontend/src/content/mediaPlaceholders.ts": "Configuration listing placeholder image and video paths for galleries.",
  "frontend/src/content/romanticMessages.ts": "Array of short romantic messages used for card backs.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, state, and AuthClient behavior.",
  "frontend/src/hooks/useLocalMedia.ts": "Hook for loading, saving, and previewing locally overridden image or video media via IndexedDB.",
  "frontend/src/hooks/useObjectPositionDrag.ts": "Provides a pointer‑drag hook that updates an object's x/y position within a container using percentage coordinates.",
  "frontend/src/hooks/useQueries.ts": "Defines a placeholder hook returning no queries since all data is client‑side.",
  "frontend/src/index.css": "Tailwind base styles with custom romantic color variables and various animation keyframes.",
  "frontend/src/lib/localMediaStore.ts": "Implements an IndexedDB‑backed store for saving, retrieving, and removing media blobs keyed by ID.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/sections/HeroSection.tsx": "Renders a romantic hero section with titles, affectionate names list, and a button to open a birthday message.",
  "frontend/src/sections/ImageMemorySection.tsx": "Displays a grid of flip image cards using gallery data, each revealing a romantic message.",
  "frontend/src/sections/SurpriseSection.tsx": "Shows a surprise love‑letter section with a modal trigger and an affectionate closing message.",
  "frontend/src/sections/VideoMemorySection.tsx": "Renders a video gallery with optional edit mode allowing users to replace videos via local media storage.",
  "frontend/tailwind.config.js": "TailwindCSS config enabling dark mode, content scanning, extended color palette using CSS vars, custom shadows, fonts, and animation keyframes.",
  "project_state.json": "Project metadata describing a romantic mobile-first website, its features, requirements, issues, and architectural notes for ongoing development."
}