{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing three background-audio-related features, their associated files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend files and their responsibilities across styling, sections, media, and components.",
  "frontend/index.css": "Tailwind base file defining extensive OKLCH color variables for light/dark themes and applying global background/text styles.",
  "frontend/index.html": "Basic HTML shell containing root div and loading the Vite entry script main.tsx.",
  "frontend/src/App.tsx": "Main SPA component handling passcode gating, entry/message modals, navigation to hero section, background ambiance, and full page layout.",
  "frontend/src/components/ambient/RomanticBackground.tsx": "Renders floating heart, petal, and sparkle emoji elements with staggered animations as a fixed ambient background layer.",
  "frontend/src/components/gallery/FlipImageCard.tsx": "3D flip-card component supporting image replacement via IndexedDB, with error handling and a persistent front-side upload button.",
  "frontend/src/components/gate/PasscodeGate.tsx": "Numeric keypad lock screen validating a 12‑digit passcode with shake animation and error feedback before unlocking.",
  "frontend/src/components/media/BackgroundMusicPlayer.tsx": "Autoplays and loops background music with fade-in, mute, and play controls, handling autoplay errors and visibility.",
  "frontend/src/components/modals/EntryModal.tsx": "Displays an entry dialog with themed styling and a button to proceed.",
  "frontend/src/components/modals/LoveLetterModal.tsx": "Shows a scrollable dialog containing a long romantic letter.",
  "frontend/src/components/modals/RomanticMessageModal.tsx": "Renders a birthday-themed dialog with animated decorative emojis.",
  "frontend/src/components/ornaments/BlinkingEmojiSequence.tsx": "Animates a sequence of emojis that blink and scale in a timed loop.",
  "frontend/src/content/mediaPlaceholders.ts": "Defines placeholder image and video lists with instructions for replacing media.",
  "frontend/src/content/romanticMessages.ts": "Exports an array of romantic text messages for displaying on image card backs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useLocalMedia.ts": "React hook for loading, saving, previewing, and clearing user-provided media via IndexedDB with object URL management.",
  "frontend/src/hooks/useObjectPositionDrag.ts": "Hook enabling pointer-based dragging to adjust x/y object-position percentages within a container.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning no queries since all data is client-side.",
  "frontend/src/index.css": "Tailwind setup defining theme variables and custom romantic animations including hearts, petals, sparkles, and more.",
  "frontend/src/lib/localMediaStore.ts": "IndexedDB-backed store for saving, retrieving, and removing media blobs with stable keys.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps with Internet Identity provider.",
  "frontend/src/sections/HeroSection.tsx": "Hero section with romantic birthday text, name list, and a button to open a message.",
  "frontend/src/sections/ImageMemorySection.tsx": "Grid section displaying flip image cards sourced from gallery data with paired romantic messages.",
  "frontend/src/sections/SurpriseSection.tsx": "Surprise section featuring a love‑letter modal trigger and closing romantic message.",
  "frontend/src/sections/VideoMemorySection.tsx": "Renders a video gallery with an optional edit mode that allows replacing individual videos using local file uploads and preview handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and theme extensions for the romantic UI style.",
  "project_state.json": "Defines the project’s current state, requirements, known issues, and architectural notes for the romantic mobile-first birthday site."
}